//Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
let str = '';
for (n = 20; n < 31; n = n + 0.5) {
     str += n + ' ';
}
alert( str );

//Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
let x = 27;
let str2 = '';
for ( y = 20; y < 110; y = y + 10) {
    str2 += y * x + ' ';
}
alert( str2 );

//Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let c = +prompt('Введите число');
let str3 = '';
for(i = 1; i < 101; i++) {
    if(i**2 < c) {
        str3 += i + ' ';
    }
}
alert(`Квадрат этих чисел не превышает ваше число: ${str3}`);

//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
let numb = +prompt('Проверка на простое число');
for (n = 2; n < numb; n++) {
    if( numb % n === 0) {
        alert (' Ваше число не простое');
        break;
    } else {
        alert ('Ваше число простое');
        break;
    }
}

//Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let num = +prompt('Введите число чтоб проверить можно ли его получить путем возведения 3 в степень');
if( num % 3 == 0 && num) {
    alert('Можно получить');
}else {
    alert('Нельзя получить');
}